import styles from "./Tables.module.css";

export const CasesTable = () => {
  return (
    <div>
    <table border="1" className = {styles.table}>
  <thead>
    <tr>
      <th>№</th>
      <th>Септік (падеж)</th>
      <th>Сұрақтары (вопросы)</th>
      <th>Жалғау (окончание)</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>1</td>
      <td>Атау септік (Именительный падеж)</td>
      <td>кім? не? кто? что?</td>
      <td>—</td>
    </tr>
    <tr>
      <td>2</td>
      <td>Ілік септік (Родительный падеж)</td>
      <td>кімнің? ненің? кого? чего?</td>
      <td>-ның, -нің, -дың, -дің, -тың, -тің</td>
    </tr>
    <tr>
      <td>3</td>
      <td>Барыс септік (Дательный падеж)</td>
      <td>кімге? неге? қайда? кому? чему? куда?</td>
      <td>-ға, -ге, -қа, -ке</td>
    </tr>
    <tr>
      <td>4</td>
      <td>Табыс септік (Винительный падеж)</td>
      <td>кімді? нені? кого? что?</td>
      <td>-ды, -ді, -ты, -ті, -ны, -ні</td>
    </tr>
    <tr>
      <td>5</td>
      <td>Жатыс септік (Местный падеж)</td>
      <td>кімде? неде?</td>
      <td>-да, -де, -та, -те</td>
    </tr>
    <tr>
      <td>6</td>
      <td>Шығыс септік (Исходный падеж)</td>
      <td>кімнен? неден? от кого? от чего?</td>
      <td>-нан, -нен, -дан, -ден, -тан, -тен</td>
    </tr>
    <tr>
      <td>7</td>
      <td>Көмектес септік (Творительный падеж)</td>
      <td>кіммен? немен?</td>
      <td>-мен, -бен, -пен (жуан түрі болмайды)</td>
    </tr>
  </tbody>
</table>
</div>
  );
};